Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K15.tmx
Source language: en_us
Languages: zh_cn

source: Gravel
zh_cn: 砾石坑

source: At that time we were living beside a gravel pit.
zh_cn: 当时我们住在一个砾石坑附近。

source: Not a large one, hollowed out by monster machinery, just a minor pit that a farmer must have made some money from years before.
zh_cn: 并不大，是用怪物机挖出来的，就是那种几年前农民为了赚点钱肯定会挖的小坑。

source: In fact, the pit was shallow enough to lead you to think that there might have been some other intention for it - foundations for a house, maybe, that never made it any further.
zh_cn: 事实上，那坑浅得让你觉得好像它原来肯定有别的用处，比如房子的地基之类的，那种你永远都不会在它上面动下一步的地基。

source: My mother was the one who insisted on calling attention to it.
zh_cn: 我母亲是唯一坚持要我们小心这个砾石坑的人。

source: "We live by the old gravel pit out the service-station road," she'd tell people, and laugh, because she was so happy to have shed everything connected with the house, the street - the husband - with the life she'd had before.
zh_cn: “我们住在一个旧砾石坑旁边，这路上都没有加油站”，她会这么告诉别人，然后大笑，因为她摆脱了所有和房子有关的东西--街道，从前和她一起生活的丈夫，她觉得很开心。

source: I barely remember that life.
zh_cn: 我几乎不记得那段日子了。

source: That is, I remember some parts of it clearly, but without the links you need to form a proper picture.
zh_cn: 我是说，有些事记得很清楚，但是我没法用清晰的线索勾勒出一幅恰当的图片。

source: All that I retain in my head of the house in town is the wallpaper with Teddy bears in my old room.
zh_cn: 关于那所镇上的房子，我记忆里留下的只有我那个旧房间里的泰迪熊墙纸。

source: In this new house, which was really a trailer, my sister, Caro, and I had narrow cots, stacked one above the other.
zh_cn: 在这所新房子，或者不如说是露营车里，我和姐姐卡萝睡的是狭窄的双层帆布床，一层叠着另一层。

source: When we first moved there, Caro talked to me a lot about our old house, trying to get me to remember this or that.
zh_cn: 我们刚搬到那儿时，卡萝常和我聊起老屋，企图让我记起样那样的事。

source: It was when we were in bed that she talked like this, and generally the conversation ended with me failing to remember and her getting cross.
zh_cn: 然而有些事我都不记得了，她会因此生气，这些对话也就这样逐渐结束了。

source: Sometimes I thought I did remember, but out of contrariness or fear of getting things wrong I pretended not to.
zh_cn: 有时我觉得我是记得的，但是为了免于纠结或是因为担心混淆事情，我干脆装作不记得了。

source: It was summer when we moved to the trailer. We had our dog with us. Blitzee.
zh_cn: 我们搬到露营车里的时候是夏天，还有我们的狗狗布利兹。

source: "Blitzee loves it here," my mother said, and it was true.
zh_cn: “布利兹喜欢这儿，” 母亲说，的确如此。

source: What dog wouldn't love to exchange a town street, even one with spacious lawns and big houses, for the wide-open countryside?
zh_cn: 对一条狗来说，用敞朗的乡下地块换掉城镇的街道，尽管镇上有大草坪大楼房，这样一笔交易，有什么可不称心的呢？。

source: She took to barking at every car that went past, as if she owned the road, and now and then she brought home a squirrel or a groundhog she'd killed.
zh_cn: 她对经过的每辆车都狂吠，就好像整条路都是她的，还时不时往家里叼回来一只她咬死的松鼠或土拨鼠。

source: At first Caro was quite upset by this, and Neal would have a talk with her, explaining about a dog's nature and the chain of life in which some things had to eat other things.
zh_cn: 起初卡萝对这些很反感，尼尔就会找她谈，跟她解释这是狗的天性，食物链里必须有一方吃另一方。

source: "She gets her dog food," Caro argued, but Neal said, "Suppose she didn't? Suppose someday we all disappeared and she had to fend for herself?"
zh_cn: “她有狗粮可以吃啊”，卡萝争辩道，但是尼尔说，“但是如果她没吃呢？如果有一天我们全都不在了，她怎么喂饱自己呢？”

source: "I'm not going to," Caro said. "I'm not going to disappear, and I'm always going to look after her."
zh_cn: “我不会的，”卡萝回道，“我不会走开的，我会永远照顾她。”

source: "You think so?" Neal said, and our mother stepped in to deflect him.
zh_cn: “你确定么？”尼尔反问，这时母亲走进来把他撵走。

source: Neal was always ready to get on the subject of the Americans and the atomic bomb, and our mother didn't think we were ready for that yet.
zh_cn: 尼尔总喜欢讨论美国人和原子弹，母亲觉得对我和卡萝来说，这些话题还为时过早。

source: She didn't know that when he brought it up I thought he was talking about an atomic bun.
zh_cn: 她并不知道每次尼尔谈起这些的时候我老觉得他在说原子弹甜面包（一种花式圆面包）。

source: I knew that there was something wrong with this interpretation, but I wasn't about to ask questions and get laughed at.
zh_cn: 我知道我的理解有点问题，但是我不打算提问，免得被嘲笑。

source: Neal was an actor. In town there was a professional summer theatre, a new thing at the time, which some people were enthusiastic about and others worried about, fearing that it would bring in riffraff.
zh_cn: 尼尔是个演员，镇上有个专业的夏日剧场，在那会儿是个新玩意儿，有人为之狂热，有人为之忧虑，担心剧院招来一些混混。

source: My mother and father had been among those in favor, my mother more actively so, because she had more time.
zh_cn: 我父母都站在支持的那边，母亲尤甚，因为她更闲。

source: My father was an insurance agent and travelled a lot.
zh_cn: 父亲做保险经纪，常出差。

source: My mother had got busy with various fund-raising schemes for the theatre and donated her services as an usher.
zh_cn: 母亲则忙着为剧场募集自己，她自己也在那里做志愿引座员。

source: She was good-looking and young enough to be mistaken for an actress.
zh_cn: 她那时年轻漂亮，常被误认为演员。

source: She'd begun to dress like an actress, too, in shawls and long skirts and dangling necklaces.
zh_cn: 慢慢她也开始像女演员一样穿戴，长裙，披肩，吊坠项链。

source: She'd left her hair wild and stopped wearing makeup.
zh_cn: 她会野性十足地披着头发，素面朝天。

source: Of course, I had not understood or even particularly noticed these changes at the time.
zh_cn: 当然，当时我无法理解她的这些改变，我甚至都没怎么注意到这些。

source: My mother was my mother.
zh_cn: 我觉得母亲还是我的母亲。

source: But no doubt Caro had.
zh_cn: 但是毫无疑问，卡萝注意到了。

source: And my father.
zh_cn: 父亲也注意到了。

source: Though, from all that I know of his nature and his feelings for my mother, I think he may have been proud to see how good she looked in these liberating styles and how well she fit in with the theatre people.
zh_cn: 这些前卫造型能衬出母亲的美丽，她和剧院的人处得也很融洽，以我对父亲的个性和他对母亲的感情的了解，他应该对这些感到非常骄傲。

source: When he spoke about this time later on, he said that he had always approved of the arts.
zh_cn: 后来谈起那段时光，父亲总是说他一直很支持艺术事业。

source: I can imagine now how embarrassed my mother would have been, cringing and laughing to cover up her cringing, if he'd made this declaration in front of her theatre friends.
zh_cn: 尽管当时如此，现在假如父亲当着母亲剧院的那些朋友这样宣告，她一定会觉得尴尬，拘谨地笑笑，来掩饰她的不安。

source: Well, then came a development that could have been foreseen and probably was, but not by my father.
zh_cn: 然后，就发生了预想得到的变化，可能谁都猜得到，除了父亲。

source: I don't know if it happened to any of the other volunteers.
zh_cn: 我不知道这种事是不是也发生在其他志愿者的身上。

source: I do know, though I don't remember it, that my father wept and for a whole day followed my mother around the house, not letting her out of his sight and refusing to believe her.
zh_cn: 尽管我不记得了，但是我确确实实知道，父亲整日哭泣，跟在母亲身后，跟着她在屋子周围转悠，不让她走出他的视线，也不愿意再相信她。

source: And, instead of telling him anything to make him feel better, she told him something that made him feel worse.
zh_cn: 至于我母亲，她没有跟父亲说任何让他觉得好过一点的事，却说了件让他觉得更糟的事。

source: She told him that the baby was Neal's.Was she sure?Absolutely. She had been keeping track.What happened then?
zh_cn: 她告诉他，孩子是尼尔的。她确定？错不了。她一直算着日子。然后呢？

source: My father gave up weeping. He had to get back to work.
zh_cn: 然后父亲停止了哭泣，继续工作。

source: My mother packed up our things and took us to live with Neal in the trailer he had found, out in the country.
zh_cn: 母亲打包好东西，带着我们来到了乡下，和尼尔一起住在他找到的露营车里。

source: She said afterward that she had wept, too. But she said also that she had felt alive.
zh_cn: 她说后来她也哭过，但是她觉得她在活着。

source: Maybe for the first time in her life, truly alive.
zh_cn: 也许是她一生中第一次，真真切切地活着。

source: She felt as if she had been given a chance; she had started her life all over again.
zh_cn: 她觉得好像得到了另一个机会，一个让她的生活彻底重新翻牌的机会。

source: She'd walked out on her silver and her china and her decorating scheme and her flower garden and even on the books in her bookcase.
zh_cn: 她从那个地方走了出来，留下她的银器和瓷器，她的装修方案，她的花园，甚至她书架上的书。

source: She would live now, not read.
zh_cn: 从现在起她要开始生活，而不是阅读。

source: She'd left her clothes hanging in the closet and her high-heeled shoes in their shoe trees. Her diamond ring and her wedding ring on the dresser.
zh_cn: 她宁愿留下挂在柜子里的衣服，鞋架上的高跟鞋，留下她梳妆台上的钻戒和婚戒，留下她抽屉里的那些丝绸晚礼服。

source: Her silk nightdresses in their drawer. She meant to go around naked at least some of the time in the country, as long as the weather stayed warm.
zh_cn: 有时，只要天气和暖，她会故意一丝不挂地出门，在乡间走动。

source: That didn't work out, because when she tried it Caro went and hid in her cot and even Neal said he wasn't crazy about the idea.
zh_cn: 但那行不通，因为每次当她尝试裸走，卡萝都会躲到她的小床上，尼尔怎么解释母亲没疯都没用。

source: What did he think of all this? Neal. His philosophy, as he put it later, was to welcome whatever happened.
zh_cn: 对这一切，尼尔是怎么想的呢？如他后来说的那样，他的人生哲学，是拥抱发生的一切事情。

source: Everything is a gift.
zh_cn: 任何事都是一件天赐的礼物。

source: We give and we take.
zh_cn: 我们付出，然后我们获取。

source: I am suspicious of people who talk like this, but I can't say that I have a right to be.
zh_cn: 对于用这种口吻说话的人，我总是报之以怀疑，但是我不能说我有权利这么做。

source: He was not really an actor.
zh_cn: 他并不是个真正的演员。

source: He had got into acting, he said, as an experiment.
zh_cn: 他只是很爱表演，他说，演戏像是一种实验。

source: To see what he could find out about himself.
zh_cn: 表演能让他挖掘自己，看看他的灵魂里有些什么东西。

source: In college, before he dropped out, he had performed as part of the chorus in "Oedipus Rex."
zh_cn: 在他从大学退学前，他在《俄狄浦斯王》的合唱里扮演一个角色。

source: He had liked that - the giving yourself over, blending with others.
zh_cn: 他很喜欢那么做--把自己彻底地付出，投入，然后与他人融合在一起。

source: Then one day, on the street in Toronto, he ran into a friend who was on his way to try out for a summer job with a new small-town theatre company.
zh_cn: 然后某一天，在多伦多的一条街上，他碰到了一个朋友，那个朋友正要去一个新的小镇剧院公司招一份暑期工。

source: He went along, having nothing better to do, and ended up getting the job, while the other fellow didn't.
zh_cn: 他也跟着去了，因为找不到更好的事情做，结果他得到了那份工作，他朋友却没有。

source: He would play Banquo.
zh_cn: 他在戏里扮演班柯。

source: Sometimes they make Banquo's ghost visible, sometimes not.
zh_cn: 有时他们让班柯的鬼魂被看见，有时让它隐形。

source: This time they wanted a visible version and Neal was the right size.
zh_cn: 这回他们想要一个看得见的班柯，尼尔的身板正合他们心意。

source: An excellent size.
zh_cn: 一个很棒的尺码。

source: A solid ghost.
zh_cn: 一个结实的鬼魂。

source: He had been thinking of wintering in our town anyway, before my mother sprang her surprise.
zh_cn: 在母亲接开她的秘密之前，他想过在我们镇上过冬。

source: He had already spotted the trailer.
zh_cn: 当时他已经看中了那辆越野车。

source: He had enough carpentry experience to pick up work renovating the theatre, which would see him through till spring.
zh_cn: 他有足够的干木匠活儿的经验，翻新剧院完全没有问题，这些活儿足够他做到春天了。

source: That was as far ahead as he liked to think.
zh_cn: 他愿意想到的就是这么远了。

source: Caro didn't even have to change schools.
zh_cn: 卡萝甚至用不着转校。

source: She was picked up by the school bus at the end of the short lane that ran alongside the gravel pit.
zh_cn: 她在小路的尽头坐校车，路边就挨着满是碎石的砾石坑。

source: She had to make friends with the country children, and perhaps explain some things to the town children who had been her friends the year before, but if she had any difficulty with that I never heard about it.
zh_cn: 她只能和乡下孩子作朋友，也许还会和镇上的孩子们解释些什么，那些孩子前一年还是她的朋友。但是要说她面对这些觉得有难处的话，我却从来没从她那里听到过任何表示。

source: Blitzee was always waiting by the road for her to come home.
zh_cn: 布利兹总是在路边等着她回家。

source: I didn't go to kindergarten, because my mother didn't have a car.
zh_cn: 我没去上幼儿园，因为母亲没有车。

source: But I didn't mind doing without other children.
zh_cn: 但我并不介意没有其他孩子陪我。

source: Caro, when she got home, was enough for me.
zh_cn: 当卡萝回家时，我就有伴儿了。

source: And my mother was often in a playful mood.
zh_cn: 而且母亲也总是一副玩性甚浓的样子。

source: As soon as it snowed that winter she and I built a snowman and she asked, "Shall we call it Neal?" I said O.K., and we stuck various things on it to make it funny.
zh_cn: 那天冬天一下雪，她就和我一起堆了一个雪人，她问，“我们能叫他尼尔么？”我说可以啊，然后我们往雪人身上粘了好多东西，它看起来很滑稽。

source: Then we decided that I would run out of the house when his car came and say, "Here's Neal, here's Neal!" but be pointing up at the snowman.
zh_cn: 我们商量好，当尼尔的车开进来时，我就跑出屋子，大喊“尼尔在这尔！尼尔在这儿！”，这话要指着雪人说，而不是真正的尼尔。

source: Which I did, but Neal got out of the car mad and yelled that he could have run me over.
zh_cn: 我这么干了，但是尼尔下车的时候却抓狂了，冲我大吼刚才他差点从我身上碾过去。

source: That was one of the few times that I saw him act like a father.
zh_cn: 那一次是我看过他为数不多的表现得像父亲的一次。

source: Those short winter days must have seemed strange to me - in town, the lights came on at dusk.
zh_cn: 那个短暂的冬天对我来说极为陌生--我看到镇上的灯光亮了又暗。

source: But children get used to changes.
zh_cn: 但是孩子们总是很容易习惯改变。

source: Sometimes I wondered about our other house. I didn't exactly miss it or want to live there again - I just wondered where it had gone.
zh_cn: 有时我会对我们的另一栋屋子感到好奇，我并不想念它，也并不想再搬回那里住--我只是好奇它去了哪里。

source: My mother's good times with Neal went on into the night.
zh_cn: 母亲和尼尔的快乐时光一直延伸入夜。

source: If I woke up and had to go to the bathroom, I'd call for her.
zh_cn: 假如我晚上醒来要上厕，我会叫她。

source: She would come happily but not in any hurry, with some piece of cloth or a scarf wrapped around her - also a smell that I associated with candlelight and music.
zh_cn: 她总是不慌不忙地过来，非常开心，用某块布或者毛巾包着身体--身上散发着一种令我联想到烛光和音乐的气息。

source: And love.
zh_cn: 还有爱情。

source: Something did happen that was not so reassuring, but I didn't try to make much sense of it at the time.
zh_cn: 后来发生了一件让人觉得不那么安心的事。当时我并没有觉得那件事有什么特殊意义。

source: Blitzee, our dog, was not very big, but she didn't seem small enough to fit under Caro's coat.
zh_cn: 我们的狗狗布利兹，虽然不是条大型犬，但是看起来也不至于小到能穿上卡萝的外套。

source: I don't know how Caro managed to do it.
zh_cn: 我不知道卡萝是怎么想法给它套上的。

source: Not once but twice.
zh_cn: 而且不只一次，是两次。

source: She hid the dog under her coat on the school bus, and then, instead of going straight to school, she took Blitzee back to our old house in town, which was less than a block away.
zh_cn: 她把狗狗藏在外套里，带上小车，然后，并没有直接去学校，而是去了距此不到一条街的镇上的老家。

source: That was where my father found the dog, on the winter porch, which was not locked, when he came home for his solitary lunch.
zh_cn: 冬天的门廊没有上锁，父亲就是在那儿发现布利兹的，当时他刚回家，准备孤独地吃午餐。

source: There was great surprise that she had got there, found her way home like a dog in a story.
zh_cn: 对他来说，她回去真是一个天大的惊喜，像故事里的狗那样找到了回家的路。

source: Caro made the biggest fuss, and claimed not to have seen the dog at all that morning.
zh_cn: 卡萝前所未有地焦躁，声称她一整个早上都没有见过狗。

source: But then she made the mistake of trying it again, maybe a week later, and this time, though nobody on the bus or at school suspected her, our mother did.
zh_cn: 但是大概一周之后，当她故技重施的时候却露陷了，这一次，尽管校车上和学校里所有人都没有怀疑她有什么不对劲，妈妈却察觉到了。

source: I can't remember if our father brought Blitzee back to us.
zh_cn: 我记不得是否是父亲把布利兹带来还给我们。

source: I can't imagine him in the trailer or at the door of the trailer or even on the road to it.
zh_cn: 我没法想象他在露营车里，或者站在车门旁，我甚至无法想象他在来这里的路上。

source: Maybe Neal went to the house in town and picked her up.
zh_cn: 也许是尼尔去了镇上的那栋屋，把她接回来的。

source: Not that that's any easier to imagine.
zh_cn: 这并不是说这情景就更容易想象一些。

source: If I've made it sound as though Caro was unhappy or scheming all the time, that isn't the truth.
zh_cn: 如果我讲的这些让卡萝听起来像总是闷闷不乐或者诡计多端的样子，那事实并不是这样的。

source: As I've said, she did try to make me talk about things, at night in bed, but she wasn't constantly airing grievances.
zh_cn: 如我所说，晚上睡觉时，她总想让我聊着聊那的，但是她并不总是在诉苦。

source: It wasn't her nature to be sulky.
zh_cn: 她天性并不阴郁。

source: She was far too keen on making a good impression.
zh_cn: 她太热衷于给人留下好印象了。

source: She liked people to like her; she liked to stir up the air in a room with the promise of something you could even call merriment.
zh_cn: 她喜欢大家都喜爱她，喜欢在房间里搅气氛，做出种种承诺，你简直可以管那些诺言叫做欢乐。

source: She thought more about that than I did.
zh_cn: 对于这些，她想得比我多太多了。

source: She was the one who most took after our mother, I think now.
zh_cn: 现在我以为，那时她是最像母亲的那一个。

source: There must have been some probing about what she'd done with the dog.
zh_cn: 肯定有人好奇她到底对狗做了什么吧。

source: I think I can remember some of it.
zh_cn: 我想我大概能记起来一些。

source: "I did it for a trick."
zh_cn: “我只是觉得好玩来着。”

source: "Do you want to go and live with your father?"
zh_cn: “你想去和爸爸一起住么？”

source: I believe that was asked, and I believe she said no.
zh_cn: 我肯定当时问了这个问题，而且她肯定说了不。

source: I didn't ask her anything.
zh_cn: 我没问她任何事。

source: What she had done didn't seem strange to me.
zh_cn: 我不觉得她做的事情很奇怪。

source: That's probably how it is with younger children - nothing that the strangely powerful older child does seems out of the ordinary.
zh_cn: 年幼的孩子大概都会这么想--异常强大的年长的孩子所做的事情，都没有什么不寻常的吧。

source: Our mail was deposited in a tin box on a post, down by the road.
zh_cn: 我们的信件投在邮局的一个锡信箱里，就在路那头的边上。

source: My mother and I would walk there every day, unless it was particularly stormy, to see what had been left for us.
zh_cn: 除非是暴雨天，我和母亲每天都会走到那儿去，看看谁给我们寄了什么。

source: We did this after I got up from my nap.
zh_cn: 我们总是在我午睡醒来之后出发。

source: Sometimes it was the only time we went outside all day.
zh_cn: 有时那是我们整天唯一一次外出的时机。

source: In the morning, we watched children's television shows - or she read while I watched. (She had not given up reading for very long.) We heated up some canned soup for lunch, then I went down for my nap while she read some more.
zh_cn: 早上我们一起看儿童电视节目--或者是我看电视，她读书(她并没荒废读书多久)。中午我们热些罐头汤，然后我就下去睡午觉，她继续读书。

source: She was quite big with the baby now and it stirred around in her stomach, so that I could feel it.
zh_cn: 有了孩子以后，她变得很臃肿，胎儿总是在她肚子里翻跟头，我能摸到它。

source: Its name was going to be Brandy - already was Brandy - whether it was a boy or a girl.
zh_cn: 我们也许会叫它布兰迪--后来确实叫了这名字--不管是男孩还是女孩。
